In [5]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
df = pd.read_csv("tech.csv", delimiter= '\t', index_col='Company')

In [8]:
df

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States
Huawei                129184     197000         Shenzhen          China
Dell Technologies      92224     158000            Texas  United States
Facebook               85965      58604       California  United States
Sony                   84893     109700            Tokyo          Japan
Hitachi                82345     350864            Tokyo          Japan
Intel                  77867     110600       California  United States
IBM                    73620     364800         New York  United States
Tencent                69864      85858         Shenzhen          China
Panasonic              63191     243540            Osaka          Japan
Lenovo                 60742      71500        Hong Kong          China
HP Inc.                56639      53000       California  United States
LG Electronics         53625      75000            Seoul    South Korea

In [30]:
df.head()

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States

In [31]:
df.tail()

                Revenue  Employees        City        Country
Company
Tencent           69864      85858    Shenzhen          China
Panasonic         63191     243540       Osaka          Japan
Lenovo            60742      71500   Hong Kong          China
HP Inc.           56639      53000  California  United States
LG Electronics    53625      75000       Seoul    South Korea

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, Apple to LG Electronics
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Revenue    17 non-null     int64
 1   Employees  17 non-null     int64
 2   City       17 non-null     object
 3   Country    17 non-null     object
dtypes: int64(2), object(2)
memory usage: 680.0+ bytes

In [33]:
df.describe()

             Revenue      Employees
count      17.000000      17.000000
mean   112523.235294  204125.470588
std     63236.957691  198345.912495
min     53625.000000   53000.000000
25%     69864.000000   85858.000000
50%     84893.000000  147000.000000
75%    143015.000000  243540.000000
max    274515.000000  878429.000000

In [34]:
df.shape #numero de columnas

(17, 4)

In [35]:
df.size # numero total de datos

68

In [36]:
df.ndim # numero de dimensiones

2

In [37]:
df.index #indice

Index(['Apple', 'Samsung Electronics', 'Alphabet', 'Foxconn', 'Microsoft',
       'Huawei', 'Dell Technologies', 'Facebook', 'Sony', 'Hitachi', 'Intel',
       'IBM', 'Tencent', 'Panasonic', 'Lenovo', 'HP Inc.', 'LG Electronics'],
      dtype='object', name='Company')

In [38]:
df.columns #Columnas

Index(['Revenue', 'Employees', 'City', 'Country'], dtype='object')

In [39]:
df.values #Valores

array([[274515, 147000, 'California', 'United States'],
       [200734, 267937, 'Suwon', 'South Korea'],
       [182527, 135301, 'California', 'United States'],
       [181945, 878429, 'New Taipei City', 'Taiwan'],
       [143015, 163000, 'Washington', 'United States'],
       [129184, 197000, 'Shenzhen', 'China'],
       [92224, 158000, 'Texas', 'United States'],
       [85965, 58604, 'California', 'United States'],
       [84893, 109700, 'Tokyo', 'Japan'],
       [82345, 350864, 'Tokyo', 'Japan'],
       [77867, 110600, 'California', 'United States'],
       [73620, 364800, 'New York', 'United States'],
       [69864, 85858, 'Shenzhen', 'China'],
       [63191, 243540, 'Osaka', 'Japan'],
       [60742, 71500, 'Hong Kong', 'China'],
       [56639, 53000, 'California', 'United States'],
       [53625, 75000, 'Seoul', 'South Korea']], dtype=object)

In [40]:
df.iloc[0] #Indice numerico mediante la posicion

Revenue             274515
Employees           147000
City            California
Country      United States
Name: Apple, dtype: object

In [41]:
df.iloc[-1]

Revenue            53625
Employees          75000
City               Seoul
Country      South Korea
Name: LG Electronics, dtype: object

In [42]:
df.iloc[3:5]

           Revenue  Employees             City        Country
Company
Foxconn     181945     878429  New Taipei City         Taiwan
Microsoft   143015     163000       Washington  United States

In [43]:
df.iloc[::5] #salto de 5 en 5 filas

         Revenue  Employees        City        Country
Company
Apple     274515     147000  California  United States
Huawei    129184     197000    Shenzhen          China
Intel      77867     110600  California  United States
HP Inc.    56639      53000  California  United States

In [44]:
df.loc['Apple']

Revenue             274515
Employees           147000
City            California
Country      United States
Name: Apple, dtype: object

In [45]:
df.loc['IBM']

Revenue              73620
Employees           364800
City              New York
Country      United States
Name: IBM, dtype: object

In [46]:
df.loc['Sony':'Intel']

         Revenue  Employees        City        Country
Company
Sony       84893     109700       Tokyo          Japan
Hitachi    82345     350864       Tokyo          Japan
Intel      77867     110600  California  United States

In [47]:
df['Revenue'] #Equivalente a df.renueve

Company
Apple                  274515
Samsung Electronics    200734
Alphabet               182527
Foxconn                181945
Microsoft              143015
Huawei                 129184
Dell Technologies       92224
Facebook                85965
Sony                    84893
Hitachi                 82345
Intel                   77867
IBM                     73620
Tencent                 69864
Panasonic               63191
Lenovo                  60742
HP Inc.                 56639
LG Electronics          53625
Name: Revenue, dtype: int64

In [48]:

#se pueden seleccionar varias columnas a la vez pasando por una lista

df[['Employees','City']].head()

                     Employees             City
Company
Apple                   147000       California
Samsung Electronics     267937            Suwon
Alphabet                135301       California
Foxconn                 878429  New Taipei City
Microsoft               163000       Washington

In [49]:
# Reordenacion de columnas de un dataframe
df_reordered = df[['City','Country','Revenue','Employees']]
df_reordered.head()

                                City        Country  Revenue  Employees
Company
Apple                     California  United States   274515     147000
Samsung Electronics            Suwon    South Korea   200734     267937
Alphabet                  California  United States   182527     135301
Foxconn              New Taipei City         Taiwan   181945     878429
Microsoft                 Washington  United States   143015     163000

In [50]:
# acceso a filas y colummnas
df.head()

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States

In [51]:
# acceso al primer valor de numero de empleados
df.iloc[0,0]

274515

In [52]:
# Acceso a ciudad y pais de las emmpresas sony, panasonic y lenovo
df.loc[['Sony','Panasonic','Lenovo'],['City','Country']]

                City Country
Company
Sony           Tokyo   Japan
Panasonic      Osaka   Japan
Lenovo     Hong Kong   China

In [53]:
# Acceso a la ultima fila del dataframe
df.iloc[:,-1]

Company
Apple                  United States
Samsung Electronics      South Korea
Alphabet               United States
Foxconn                       Taiwan
Microsoft              United States
Huawei                         China
Dell Technologies      United States
Facebook               United States
Sony                           Japan
Hitachi                        Japan
Intel                  United States
IBM                    United States
Tencent                        China
Panasonic                      Japan
Lenovo                         China
HP Inc.                United States
LG Electronics           South Korea
Name: Country, dtype: object

In [54]:
#Acceso a las tres ultimas columnas y a dos primeras columnas

df.iloc[-3:,:2]

                Revenue  Employees
Company
Lenovo            60742      71500
HP Inc.           56639      53000
LG Electronics    53625      75000

In [55]:
# acceso desde las filas que van desde <Apple> a <Huawei>  y a columnas que van desde
# <Revenue> a <City>
df.loc['Apple':'Huawei','Revenue':'City']

                     Revenue  Employees             City
Company
Apple                 274515     147000       California
Samsung Electronics   200734     267937            Suwon
Alphabet              182527     135301       California
Foxconn               181945     878429  New Taipei City
Microsoft             143015     163000       Washington
Huawei                129184     197000         Shenzhen

In [56]:
# Seleccion condicional
df['Country']=='United States'

Company
Apple                   True
Samsung Electronics    False
Alphabet                True
Foxconn                False
Microsoft               True
Huawei                 False
Dell Technologies       True
Facebook                True
Sony                   False
Hitachi                False
Intel                   True
IBM                     True
Tencent                False
Panasonic              False
Lenovo                 False
HP Inc.                 True
LG Electronics         False
Name: Country, dtype: bool

In [57]:
# Aplicando mascara al conjunto original de datos 📊  para obtener las empresas
# que estamos buscando
df[df['Country']=='United States']

                   Revenue  Employees        City        Country
Company
Apple               274515     147000  California  United States
Alphabet            182527     135301  California  United States
Microsoft           143015     163000  Washington  United States
Dell Technologies    92224     158000       Texas  United States
Facebook             85965      58604  California  United States
Intel                77867     110600  California  United States
IBM                  73620     364800    New York  United States
HP Inc.              56639      53000  California  United States

In [58]:
# condiciones compuestas
revenue_condition = df['Revenue'] > 100_000 # Seleccionar emmpresas con mas de 100 millones de ingresos
employees_condition = df['Employees']> 100000 # Seleccionar emmpresas con mas de 100 millones de empleados
df[revenue_condition & employees_condition] # Operador logico para combinar condiciones de seleccion

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States
Huawei                129184     197000         Shenzhen          China

In [59]:
# Comprobar sin un valor está dentro de una lista de  opciones
mask = df['City'].isin(['California','Tokio'])
df[mask]

          Revenue  Employees        City        Country
Company
Apple      274515     147000  California  United States
Alphabet   182527     135301  California  United States
Facebook    85965      58604  California  United States
Intel       77867     110600  California  United States
HP Inc.     56639      53000  California  United States

## Ejercicios

In [60]:
# Ejercicio  1 ->
dmc2 = pd.read_csv("democan.csv",index_col="Island")
dmc2

               Population     Area Province
Island
Gran Canaria       855521  1560.10     LPGC
Tenerife           928604  2034.38     SCTF
La Palma            83458   708.32     SCTF
Lanzarote          155812   845.94     LPGC
La Gomera           21678   369.76     SCTF
El Hierro           11147   278.71     SCTF
Fuerteventura      119732  1659.00     LPGC

In [61]:
dmc2.loc[::]

               Population     Area Province
Island
Gran Canaria       855521  1560.10     LPGC
Tenerife           928604  2034.38     SCTF
La Palma            83458   708.32     SCTF
Lanzarote          155812   845.94     LPGC
La Gomera           21678   369.76     SCTF
El Hierro           11147   278.71     SCTF
Fuerteventura      119732  1659.00     LPGC

In [62]:
dmc2.loc[4:5]

TypeError: cannot do slice indexing on Index with these indexers [4] of type int

In [63]:
dmc2.iloc[::2,1]

Island
Gran Canaria     1560.10
La Palma          708.32
La Gomera         369.76
Fuerteventura    1659.00
Name: Area, dtype: float64

In [64]:
dmcArea=dmc2['Area'] > 1000
dmc2[dmcArea]

               Population     Area Province
Island
Gran Canaria       855521  1560.10     LPGC
Tenerife           928604  2034.38     SCTF
Fuerteventura      119732  1659.00     LPGC

In [65]:
df.query('Country == "United States"')

                   Revenue  Employees        City        Country
Company
Apple               274515     147000  California  United States
Alphabet            182527     135301  California  United States
Microsoft           143015     163000  Washington  United States
Dell Technologies    92224     158000       Texas  United States
Facebook             85965      58604  California  United States
Intel                77867     110600  California  United States
IBM                  73620     364800    New York  United States
HP Inc.              56639      53000  California  United States

In [66]:
df.query('Revenue > 100_000 & Employees > 100_000')

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States
Huawei                129184     197000         Shenzhen          China

In [67]:
df.query('City in ["California","Tokio"]')

          Revenue  Employees        City        Country
Company
Apple      274515     147000  California  United States
Alphabet   182527     135301  California  United States
Facebook    85965      58604  California  United States
Intel       77867     110600  California  United States
HP Inc.     56639      53000  California  United States

In [68]:
size = 1_000_000

data = {
    'A':np.random.randint(1,100,size),
    'B':np.random.randint(1,100,size),
    'C':np.random.randint(1,100,size),
    'D':np.random.randint(1,100,size),
}
df= pd.DataFrame(data)
df.shape

(1000000, 4)

In [69]:
%timeit df[(df['A']>50) & (df['B']<50)]

7.87 ms ± 306 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [70]:
%timeit df.query('A > 50 & B <50')

15 ms ± 1.8 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [71]:
df_mod = df.copy()

In [72]:
df_mod.equals(df)

True

In [73]:
df_mod.head(1)

    A   B   C   D
0  47  93  31  33

In [74]:
df_mod.loc['Apple','Employees'] = 13700

In [75]:
df_mod.head(1)

      A     B     C     D  Employees
0  47.0  93.0  31.0  33.0        NaN

In [78]:
# Aumento ce ingreso
df_mod['Revenue']*=1.20

KeyError: 'Revenue'

In [77]:
df_mod['Revenue'].head()

KeyError: 'Revenue'

In [79]:
# modificacion de datos existentes
df_mod['City'] = 'Vigo'
df_mod['Countr'] = 'Spain'

df_mod.head()

      A     B     C     D  Employees  City Countr
0  47.0  93.0  31.0  33.0        NaN  Vigo  Spain
1  44.0   1.0  14.0  63.0        NaN  Vigo  Spain
2  56.0  85.0  16.0  28.0        NaN  Vigo  Spain
3   4.0  76.0  28.0  45.0        NaN  Vigo  Spain
4  89.0  77.0  69.0  15.0        NaN  Vigo  Spain

In [80]:
iso3166 = {
    'United States': 'USA' ,
    'South Korea': 'KOR',
    'Taiwan': 'TWN',
    'China': 'CHN',
    'Japan': 'JPN'
}
df['Country'].replace(iso3166)

KeyError: 'Country'

In [ ]:
# Ejercicio: Recodifique la columna Province del «dataset» democan de tal manera que aparezcan las
# provincias con el texto completo: Santa Cruz de Tenerife y Las Palmas de Gran Canaria.

dmc2 = pd.read_csv("democan.csv",index_col="Island")
dmc2

iso3166 = {
    'SCTF': 'Santa Cruz de Tenerife',
    'LPGC': 'Las Palmas de Gran Canaria'
}
dmc2['Province'].replace(iso3166)

Island
Gran Canaria     Las Palmas de Gran Canaria
Tenerife             Santa Cruz de Tenerife
La Palma             Santa Cruz de Tenerife
Lanzarote        Las Palmas de Gran Canaria
La Gomera            Santa Cruz de Tenerife
El Hierro            Santa Cruz de Tenerife
Fuerteventura    Las Palmas de Gran Canaria
Name: Province, dtype: object

In [81]:
# Insertando y borrando filas
cisco = pd.Series(data=[51_904, 75_900, 'California', 'United States'],index= df_mod.columns, name= 'Cisco')
cisco

ValueError: Length of values (4) does not match length of index (7)

In [ ]:
# Agregar la serie al dataframe
df_mod = df_mod._append(cisco)
df_mod.tail(3)

                Revenue  Employees        City        Country
Company
HP Inc.           56639      53000  California  United States
LG Electronics    53625      75000       Seoul    South Korea
Cisco             51904      75900  California  United States

In [ ]:
# Eliminar filas
df_mod = df_mod.drop(labels=['Facebook','Tencent','Hitachi'])
df_mod.index

Index(['Apple', 'Samsung Electronics', 'Alphabet', 'Foxconn', 'Microsoft',
       'Huawei', 'Dell Technologies', 'Sony', 'Intel', 'IBM', 'Panasonic',
       'Lenovo', 'HP Inc.', 'LG Electronics'],
      dtype='object', name='Company')

In [ ]:
#insertando y eliminando columnas
expenses = np.random.randint(50_000,300_000,size=17)
expenses

array([268539,  82493, 262765, 116614, 117839, 263149, 168225, 129309,
       276291, 191248, 130859, 245620, 204279,  58170,  59132, 203670,
       283357])

In [ ]:
df_mod['Expenses']= expenses
df_mod.head()

,Revenue,Employees,City,Country,Expenses
Company,,,,,
Apple,274515,147000,California,United States,268539
Samsung Electronics,200734,267937,Suwon,South Korea,82493
Alphabet,182527,135301,California,United States,262765
Foxconn,181945,878429,New Taipei City,Taiwan,116614
Microsoft,143015,163000,Washington,United States,117839

In [ ]:
df_mod.columns

Index(['Revenue', 'Employees', 'City', 'Country', 'Expenses'], dtype='object')

In [ ]:
# Eliminar la columna
df_mod = df_mod.drop(labels='Expenses', axis =1)
df_mod.columns

Index(['Revenue', 'Employees', 'City', 'Country'], dtype='object')

In [ ]:
# Paraametro inplace --- Borrado que devuelve copia con las modificaciones
df_mod.head()

                     Revenue  Employees             City        Country
Company
Apple                 274515     147000       California  United States
Samsung Electronics   200734     267937            Suwon    South Korea
Alphabet              182527     135301       California  United States
Foxconn               181945     878429  New Taipei City         Taiwan
Microsoft             143015     163000       Washington  United States

In [ ]:
df_mod.drop(labels=['City','Country'],axis=1,inplace=True)
df_mod.head()

                     Revenue  Employees
Company
Apple                 274515     147000
Samsung Electronics   200734     267937
Alphabet              182527     135301
Foxconn               181945     878429
Microsoft             143015     163000

In [ ]:
# Renombrando columnas rename()
new_columns = {'Revenue':'rev','Employees':'emp','City':'cit','Country':'cou'}
df.rename(columns=new_columns).head(3)

                        rev     emp         cit            cou
Company
Apple                274515  147000  California  United States
Samsung Electronics  200734  267937       Suwon    South Korea
Alphabet             182527  135301  California  United States

In [ ]:
# Lambda

In [ ]:
# Manejo de cadenas de texto
df['City'].str.upper()

Company
Apple                       CALIFORNIA
Samsung Electronics              SUWON
Alphabet                    CALIFORNIA
Foxconn                NEW TAIPEI CITY
Microsoft                   WASHINGTON
Huawei                        SHENZHEN
Dell Technologies                TEXAS
Facebook                    CALIFORNIA
Sony                             TOKYO
Hitachi                          TOKYO
Intel                       CALIFORNIA
IBM                           NEW YORK
Tencent                       SHENZHEN
Panasonic                        OSAKA
Lenovo                       HONG KONG
HP Inc.                     CALIFORNIA
LG Electronics                   SEOUL
Name: City, dtype: object

In [ ]:
# Expresiones regulares
df['Country'].str.replace(' ','_')

Company
Apple                  United_States
Samsung Electronics      South_Korea
Alphabet               United_States
Foxconn                       Taiwan
Microsoft              United_States
Huawei                         China
Dell Technologies      United_States
Facebook               United_States
Sony                           Japan
Hitachi                        Japan
Intel                  United_States
IBM                    United_States
Tencent                        China
Panasonic                      Japan
Lenovo                         China
HP Inc.                United_States
LG Electronics           South_Korea
Name: Country, dtype: object

In [ ]:
import re
# filtrar por vocales
mask = df.index.str.match(r'^[aeiou]',flags=re.IGNORECASE)

In [ ]:
df[mask]

          Revenue  Employees        City        Country
Company
Apple      274515     147000  California  United States
Alphabet   182527     135301  California  United States
Intel       77867     110600  California  United States
IBM         73620     364800    New York  United States

In [ ]:
# Sustituir valores que empiezan por ST
df['City'].str.replace(r'^[ST].*','stanton',regex=True)

Company
Apple                       California
Samsung Electronics            stanton
Alphabet                    California
Foxconn                New Taipei City
Microsoft                   Washington
Huawei                         stanton
Dell Technologies              stanton
Facebook                    California
Sony                           stanton
Hitachi                        stanton
Intel                       California
IBM                           New York
Tencent                        stanton
Panasonic                        Osaka
Lenovo                       Hong Kong
HP Inc.                     California
LG Electronics                 stanton
Name: City, dtype: object

In [ ]:
# Dividir la columna Country en 2 usando el espacio como separador
df['Country'].str.split(' ',expand=True)

                          0       1
Company
Apple                United  States
Samsung Electronics   South   Korea
Alphabet             United  States
Foxconn              Taiwan    None
Microsoft            United  States
Huawei                China    None
Dell Technologies    United  States
Facebook             United  States
Sony                  Japan    None
Hitachi               Japan    None
Intel                United  States
IBM                  United  States
Tencent               China    None
Panasonic             Japan    None
Lenovo                China    None
HP Inc.              United  States
LG Electronics        South   Korea

In [ ]:
# Manejo de fechas 
# añadir al «dataset» de empresas tecnológicas una nueva columna con las fechas
# de fundación de las empresas (en formato «string»):

df['Founded'] = ['1/9/2015', '2/9/1997', '3/3/1997', '4/4/1997', '5/5/1997', '6/6/1997', '7/7/1997'
                 ,'8/7/1997', '8/8/1997', '9/9/1997','2/9/1997', '5/5/1997', '6/6/1997','5/6/1997', '7/7/1997'
                 ,'8/8/1997', '9/9/1997'
                 ]
df.head()

,Revenue,Employees,City,Country,Founded
Company,,,,,
Apple,274515,147000,California,United States,1/9/2015
Samsung Electronics,200734,267937,Suwon,South Korea,2/9/1997
Alphabet,182527,135301,California,United States,3/3/1997
Foxconn,181945,878429,New Taipei City,Taiwan,4/4/1997
Microsoft,143015,163000,Washington,United States,5/5/1997

In [ ]:
# convertir la columna «Founded» al tipo «datetime» usando la función to_datetime():

df['Founded'] = pd.to_datetime(df['Founded'])
df.head()

,Revenue,Employees,City,Country,Founded
Company,,,,,
Apple,274515,147000,California,United States,2015-01-09
Samsung Electronics,200734,267937,Suwon,South Korea,1997-02-09
Alphabet,182527,135301,California,United States,1997-03-03
Foxconn,181945,878429,New Taipei City,Taiwan,1997-04-04
Microsoft,143015,163000,Washington,United States,1997-05-05

In [ ]:
# acceder a cada elemento de la fecha:

df['fyear'] = df['Founded'].dt.year
df['fmonth'] = df['Founded'].dt.month
df['fday'] = df['Founded'].dt.day


df.loc[:,'Founded':].head()

                       Founded  fyear  fmonth  fday
Company
Apple               2015-01-09   2015       1     9
Samsung Electronics 1997-02-09   1997       2     9
Alphabet            1997-03-03   1997       3     3
Foxconn             1997-04-04   1997       4     4
Microsoft           1997-05-05   1997       5     5

In [ ]:
# calcular el número de años que llevan activas las empresas:
pd.to_datetime('today').year - df['Founded'].dt.year

Company
Apple                   9
Samsung Electronics    27
Alphabet               27
Foxconn                27
Microsoft              27
Huawei                 27
Dell Technologies      27
Facebook               27
Sony                   27
Hitachi                27
Intel                  27
IBM                    27
Tencent                27
Panasonic              27
Lenovo                 27
HP Inc.                27
LG Electronics         27
Name: Founded, dtype: int32

In [ ]:
# empresas creadas antes del 2000
df.query('Founded <= 2000')

,Revenue,Employees,City,Country,Founded,fyear,fmonth,fday
Company,,,,,,,,
Samsung Electronics,200734,267937,Suwon,South Korea,1997-02-09,1997,2,9
Alphabet,182527,135301,California,United States,1997-03-03,1997,3,3
Foxconn,181945,878429,New Taipei City,Taiwan,1997-04-04,1997,4,4
Microsoft,143015,163000,Washington,United States,1997-05-05,1997,5,5
Huawei,129184,197000,Shenzhen,China,1997-06-06,1997,6,6
Dell Technologies,92224,158000,Texas,United States,1997-07-07,1997,7,7
Facebook,85965,58604,California,United States,1997-08-07,1997,8,7
Sony,84893,109700,Tokyo,Japan,1997-08-08,1997,8,8
Hitachi,82345,350864,Tokyo,Japan,1997-09-09,1997,9,9
Intel,77867,110600,California,United States,1997-02-09,1997,2,9
IBM,73620,364800,New York,United States,1997-05-05,1997,5,5
Tencent,69864,85858,Shenzhen,China,1997-06-06,1997,6,6
Panasonic,63191,243540,Osaka,Japan,1997-05-06,1997,5,6
Lenovo,60742,71500,Hong Kong,China,1997-07-07,1997,7,7
HP Inc.,56639,53000,California,United States,1997-08-08,1997,8,8
LG Electronics,53625,75000,Seoul,South Korea,1997-09-09,1997,9,9

In [ ]:
# Empresas creadas en Enero
df.query('Founded.dt.month == 1')

,Revenue,Employees,City,Country,Founded,fyear,fmonth,fday
Company,,,,,,,,
Apple,274515,147000,California,United States,2015-01-09,2015,1,9

In [ ]:
# Empresas creadas en el ultimo cuatrimestre del año
df.query('9 <= Founded.dt.month <= 12')

,Revenue,Employees,City,Country,Founded,fyear,fmonth,fday
Company,,,,,,,,
Hitachi,82345,350864,Tokyo,Japan,1997-09-09,1997,9,9
LG Electronics,53625,75000,Seoul,South Korea,1997-09-09,1997,9,9

In [ ]:
# la fecha se convierte en el índice del DataFrame:
df = df.reset_index().set_index('Founded').sort_index()
df.head()

,Company,Revenue,Employees,City,Country,fyear,fmonth,fday
Founded,,,,,,,,
1997-02-09,Samsung Electronics,200734,267937,Suwon,South Korea,1997,2,9
1997-02-09,Intel,77867,110600,California,United States,1997,2,9
1997-03-03,Alphabet,182527,135301,California,United States,1997,3,3
1997-04-04,Foxconn,181945,878429,New Taipei City,Taiwan,1997,4,4
1997-05-05,Microsoft,143015,163000,Washington,United States,1997,5,5

In [ ]:
# indexar de manera mas rapida
df.loc['2015']

,Company,Revenue,Employees,City,Country,fyear,fmonth,fday
Founded,,,,,,,,
2015-01-09,Apple,274515,147000,California,United States,2015,1,9

In [ ]:
# Empresas creadas entre 1970 y 2020 con loc
df.loc['1970':'2020']

,Company,Revenue,Employees,City,Country,fyear,fmonth,fday
Founded,,,,,,,,
1997-02-09,Samsung Electronics,200734,267937,Suwon,South Korea,1997,2,9
1997-02-09,Intel,77867,110600,California,United States,1997,2,9
1997-03-03,Alphabet,182527,135301,California,United States,1997,3,3
1997-04-04,Foxconn,181945,878429,New Taipei City,Taiwan,1997,4,4
1997-05-05,Microsoft,143015,163000,Washington,United States,1997,5,5
1997-05-05,IBM,73620,364800,New York,United States,1997,5,5
1997-05-06,Panasonic,63191,243540,Osaka,Japan,1997,5,6
1997-06-06,Huawei,129184,197000,Shenzhen,China,1997,6,6
1997-06-06,Tencent,69864,85858,Shenzhen,China,1997,6,6
1997-07-07,Dell Technologies,92224,158000,Texas,United States,1997,7,7
1997-07-07,Lenovo,60742,71500,Hong Kong,China,1997,7,7
1997-08-07,Facebook,85965,58604,California,United States,1997,8,7
1997-08-08,Sony,84893,109700,Tokyo,Japan,1997,8,8
1997-08-08,HP Inc.,56639,53000,California,United States,1997,8,8
1997-09-09,LG Electronics,53625,75000,Seoul,South Korea,1997,9,9
1997-09-09,Hitachi,82345,350864,Tokyo,Japan,1997,9,9
2015-01-09,Apple,274515,147000,California,United States,2015,1,9

In [ ]:
# Empresas creadas entre enero de 1997 y marzo de 1997 con loc
df.loc['1997-1':'1997-3']

,Company,Revenue,Employees,City,Country,fyear,fmonth,fday
Founded,,,,,,,,
1997-02-09,Samsung Electronics,200734,267937,Suwon,South Korea,1997,2,9
1997-02-09,Intel,77867,110600,California,United States,1997,2,9
1997-03-03,Alphabet,182527,135301,California,United States,1997,3,3

In [26]:
# Manejo de categorias
df['Continent'] = ['America', 'Asia','America', 'Asia',
                   'America', 'Asia','America', 'Asia',
                   'Asia','Asia','America','America',
                   'Asia','Asia','Asia','America', 'Asia']

In [27]:
# Ahora podemos convertir esta columna a tipo categoría:
df['Continent'].astype('category')
df['Continent'].head()

Company
Apple                  America
Samsung Electronics       Asia
Alphabet               America
Foxconn                   Asia
Microsoft              America
Name: Continent, dtype: object

In [28]:
# establecer un orden para las categorías de continentes basadas, 
# por ejemplo, en su población: Asia, África, Europa, América, Australia:
from pandas.api.types import CategoricalDtype
continents = ('Asia','Africa','Europe','America','Australia')
cat_continents = CategoricalDtype(categories= continents, ordered=True)
df['Continent'].astype(cat_continents)

Company
Apple                  America
Samsung Electronics       Asia
Alphabet               America
Foxconn                   Asia
Microsoft              America
Huawei                    Asia
Dell Technologies      America
Facebook                  Asia
Sony                      Asia
Hitachi                   Asia
Intel                  America
IBM                    America
Tencent                   Asia
Panasonic                 Asia
Lenovo                    Asia
HP Inc.                America
LG Electronics            Asia
Name: Continent, dtype: category
Categories (5, object): ['Asia' < 'Africa' < 'Europe' < 'America' < 'Australia']

In [29]:
df['Continent'].min()

'America'

In [30]:
df['Continent'].max()

'Asia'

In [12]:
# ordenar categorias alfabeticamente
df['Continent'].sort_values()

Company
Apple                  America
Lenovo                 America
Tencent                America
Intel                  America
Dell Technologies      America
Sony                   America
Microsoft              America
Alphabet               America
LG Electronics         America
Facebook                  Asia
HP Inc.                   Asia
Hitachi                   Asia
Foxconn                   Asia
IBM                       Asia
Panasonic                 Asia
Samsung Electronics       Asia
Huawei                    Asia
Name: Continent, dtype: category
Categories (2, object): ['America', 'Asia']